In [2]:
import pandas as pd 

ser1 = pd.Series(['A', 'B'], [1,2])
ser2 = pd.Series(['C', 'D'], [3,4])
print(ser1)
print(ser2)

concat1 = pd.concat([ser1, ser2])
print(concat1)

1    A
2    B
dtype: object
3    C
4    D
dtype: object
1    A
2    B
3    C
4    D
dtype: object

In [3]:
# Adding two DataFrames: 

df = pd.DataFrame([['A0','B0'],['A1', 'B1']], columns=['A', 'B'])   
print(df)
dff = pd.DataFrame([['A2','B2'],['A3','B3']], columns=['A', 'B']) 
print(dff)

concat2 = pd.concat([df, dff])
print(concat2)

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [4]:
## If we want the column-wise contcatenation we shoul type "axis=1 or axis='columns'

print(pd.concat([df, dff], axis='columns'))

    A   B   A   B
0  A0  B0  A2  B2
1  A1  B1  A3  B3

In [7]:
### Exercise Time: Import data ####

In [9]:
data_persons0 = pd.read_csv('/Users/abdulhabirkarahanli/Desktop/Data/persons0.csv')
print(data_persons0)
data_persons1 = pd.read_csv('/Users/abdulhabirkarahanli/Desktop/Data/persons1.csv')
print(data_persons1)

     name  birth_date
0     Ben    7/3/1987
1  Martin   5/24/1984
2    Andy   6/21/1973
3    Paul   7/16/1980
4  Graham  10/10/1969
     name  birth_date
0  Carina   11/5/1989
1  Karina   10/8/1991
2    Doug   1/23/1994
3    Mark   5/20/1993
4     Zoe  11/12/1990

In [10]:
# Time to combine two data sets:   
persons = pd.concat([data_persons0, data_persons1], ignore_index=True)
print(persons)
#Done

     name  birth_date
0     Ben    7/3/1987
1  Martin   5/24/1984
2    Andy   6/21/1973
3    Paul   7/16/1980
4  Graham  10/10/1969
5  Carina   11/5/1989
6  Karina   10/8/1991
7    Doug   1/23/1994
8    Mark   5/20/1993
9     Zoe  11/12/1990

### This merge() fuction is much more powerful than the concatenation (concat()) funtion. 
    There are different types of implimantation 
        1) one-to-one join
        2) many-to-one join
        3) many-to-many join

#### One-To-One Join with an example: 
     pd.merge() recognizes when DataFrames have ashared column and automatically joins this column as a key

In [12]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
print(df1)
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df2)
# It is time to merge 
df3 = pd.merge(df1, df2) ; print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### Many-to-one join : adding another columns which will match with group

In [13]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
print(df4)
#Merge all: 
print(pd.merge(df3, df4))

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

#### Many-to-many join: key column in both the left and the right array contains duplicates

In [14]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})
print(df5)
print(pd.merge(df1, df5))  #done

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### Exercise:

In [15]:
print(data_persons0)
print(persons)

     name  birth_date
0     Ben    7/3/1987
1  Martin   5/24/1984
2    Andy   6/21/1973
3    Paul   7/16/1980
4  Graham  10/10/1969
     name  birth_date
0     Ben    7/3/1987
1  Martin   5/24/1984
2    Andy   6/21/1973
3    Paul   7/16/1980
4  Graham  10/10/1969
5  Carina   11/5/1989
6  Karina   10/8/1991
7    Doug   1/23/1994
8    Mark   5/20/1993
9     Zoe  11/12/1990

### import another data file: same data set with persons=persons_all

In [16]:
persons_social = pd.read_csv('/Users/abdulhabirkarahanli/Desktop/Data/persons_social.csv')
print(persons_social)

#merging time:
print(pd.merge(persons, persons_social))

     name  friends  alcohol  neurotic
0    Andy        0       20        14
1  Karina       12       20        13
2     Ben        5       10        10
3  Martin        2       15        17
4    Paul        4        5        13
5  Graham        1       30        21
6  Carina       10       25         7
7    Doug       15       16         9
8    Mark       12       17        14
9     Zoe       17       18        13
     name  birth_date  friends  alcohol  neurotic
0     Ben    7/3/1987        5       10        10
1  Martin   5/24/1984        2       15        17
2    Andy   6/21/1973        0       20        14
3    Paul   7/16/1980        4        5        13
4  Graham  10/10/1969        1       30        21
5  Carina   11/5/1989       10       25         7
6  Karina   10/8/1991       12       20        13
7    Doug   1/23/1994       15       16         9
8    Mark   5/20/1993       12       17        14
9     Zoe  11/12/1990       17       18        13

### What if the name of the variables are NOT same?? 
        
    pd.merge() and the 'on' keywords:
        often columns names will not match'on' keyword if the both left and right DataFrames have the spicified column name (i.e., make merging variable explicit)'left_on' and 'right_on' for datasets with different column names

#### so let us define another data frame includes 'name' and 'salary'

In [17]:
df6 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print(df1.head(2)); print(df6.head(2)) # the column names are different!

print(pd.merge(df1, df6, left_on="employee", right_on="name")) 

#we can drop the name column by using \code{drop()} method
print(pd.merge(df1, df6, left_on="employee", right_on="name").drop('name', axis=1))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
   name  salary
0   Bob   70000
1  Jake   80000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000
  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

#### What if a key values is missing in one of the datasets? The 'how' argument: 
    by default: how='inner' (intersection of two input sets)
    outer means the other part of the input set A
    
### Another Example:

In [18]:
df7 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'], 'food': ['fish', 'beans', 'bread']})
df8 = pd.DataFrame({'name': ['Mary', 'Joseph',], 'drink': ['wine', 'beer']})

print(df7) ; print(df8)
# lets merge and see what Python will do by default:
print(pd.merge(df7, df8))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [19]:
# let us use 'outer join' :
    
print(pd.merge(df7, df8, how='outer'))    # all data is retained, missings are NAs 
print(pd.merge(df7, df8, how='left'))    # join over left entries
print(pd.merge(df7, df8, how='right'))   # join over right entries

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine
     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

### Exersice:

In [21]:
print(persons)

persons_job = pd.read_csv('/Users/abdulhabirkarahanli/Desktop/Data/persons_job.csv')
print(persons_job)

print(persons.head(3)); print(persons_job.head(3))
print(pd.merge(persons, persons_job, left_on='name', right_on='person')) #drop person column
print(pd.merge(persons, persons_job, left_on='name', right_on='person').drop('person', axis=1))

     name  birth_date
0     Ben    7/3/1987
1  Martin   5/24/1984
2    Andy   6/21/1973
3    Paul   7/16/1980
4  Graham  10/10/1969
5  Carina   11/5/1989
6  Karina   10/8/1991
7    Doug   1/23/1994
8    Mark   5/20/1993
9     Zoe  11/12/1990
   person       job  income
0     Ben  lecturer   20000
1  Martin  lecturer   40000
2    Andy  lecturer   35000
3    Paul  lecturer   22000
4  Graham  lecturer   50000
5  Carina   student    5000
6  Karina   student    1200
7    Doug   student    3000
8    Mark   student   10000
9     Zoe   student     600
     name birth_date
0     Ben   7/3/1987
1  Martin  5/24/1984
2    Andy  6/21/1973
   person       job  income
0     Ben  lecturer   20000
1  Martin  lecturer   40000
2    Andy  lecturer   35000
     name  birth_date  person       job  income
0     Ben    7/3/1987     Ben  lecturer   20000
1  Martin   5/24/1984  Martin  lecturer   40000
2    Andy   6/21/1973    Andy  lecturer   35000
3    Paul   7/16/1980    Paul  lecturer   22000
4  Graham  10/10/1969  Graham  lecturer   50000
5  Carina   11/5/1989  Carina   student    5000
6  Karina   10/8/1991  Karina   student    1200
7    Doug   1/23/1994    Doug   student    3000
8    Mark   5/20/1993    Mark   student   10000
9     Zoe  11/12/1990     Zoe   student     600
     name  birth_date       job  income
0     Ben    7/3/1987  lecturer   20000
1  Martin   5/24/1984  lecturer   40000
2    Andy   6/21/1973  lecturer   35000
3    Paul   7/16/1980  lecturer   22000
4  Graham  10/10/1969  lecturer   50000
5  Carina   11/5/1989   student    5000
6  Karina   10/8/1991   student    1200
7    Doug   1/23/1994   student    3000
8    Mark   5/20/1993   student   10000
9     Zoe  11/12/1990   student     600

# DONE